evidence/ops-2201-index-only-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2201.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * shift_change_search: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 15 complete and 0 interrupted iterations
shift_change_search   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 32 complete and 0 interrupted iterations
shift_change_search   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 51 complete and 0 interrupted iterations
shift_change_search   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 66 complete and 0 interrupted iterations
shift_change_search   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 81 complete and 0 interrupted iterations
shift_change_search   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 102 complete and 0 interrupted iterations
shift_change_search   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 122 complete and 0 interrupted iterations
shift_change_search   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 137 complete and 0 interrupted iterations
shift_change_search   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 158 complete and 0 interrupted iterations
shift_change_search   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 180 complete and 0 interrupted iterations
shift_change_search   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 200 complete and 0 interrupted iterations
shift_change_search   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 220 complete and 0 interrupted iterations
shift_change_search   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 240 complete and 0 interrupted iterations
shift_change_search   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 259 complete and 0 interrupted iterations
shift_change_search   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 276 complete and 0 interrupted iterations
shift_change_search   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 296 complete and 0 interrupted iterations
shift_change_search   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 317 complete and 0 interrupted iterations
shift_change_search   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 336 complete and 0 interrupted iterations
shift_change_search   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 357 complete and 0 interrupted iterations
shift_change_search   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 378 complete and 0 interrupted iterations
shift_change_search   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 400 complete and 0 interrupted iterations
shift_change_search   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 420 complete and 0 interrupted iterations
shift_change_search   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 442 complete and 0 interrupted iterations
shift_change_search   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 464 complete and 0 interrupted iterations
shift_change_search   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 484 complete and 0 interrupted iterations
shift_change_search   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 504 complete and 0 interrupted iterations
shift_change_search   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 524 complete and 0 interrupted iterations
shift_change_search   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 542 complete and 0 interrupted iterations
shift_change_search   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 563 complete and 0 interrupted iterations
shift_change_search   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 582 complete and 0 interrupted iterations
shift_change_search   [ 100% ] 200 VUs  30.0s/30s

running (0m31.0s), 180/200 VUs, 602 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 161/200 VUs, 621 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m33.0s), 140/200 VUs, 642 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m34.0s), 122/200 VUs, 660 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m35.0s), 100/200 VUs, 682 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m36.0s), 079/200 VUs, 703 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m37.0s), 060/200 VUs, 722 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m38.0s), 039/200 VUs, 743 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m39.0s), 018/200 VUs, 764 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<300' p(95)=16.59s


  █ TOTAL RESULTS 

    checks_total.......: 782     19.644553/s
    checks_succeeded...: 100.00% 782 out of 782
    checks_failed......: 0.00%   0 out of 782

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=8.94s min=248.77ms med=9.77s max=20.38s p(90)=12.56s p(95)=16.59s
      { expected_response:true }...: avg=8.94s min=248.77ms med=9.77s max=20.38s p(90)=12.56s p(95)=16.59s
    http_req_failed................: 0.00%  0 out of 782
    http_reqs......................: 782    19.644553/s

    EXECUTION
    iteration_duration.............: avg=8.94s min=254.69ms med=9.77s max=20.39s p(90)=12.57s p(95)=16.6s 
    iterations.....................: 782    19.644553/s
    vus............................: 18     min=18       max=200
    vus_max........................: 200    min=200      max=200

    NETWORK
    data_received..................: 2.8 GB 71 MB/s
    data_sent......................: 81 kB  2.0 kB/s



running (0m39.8s), 000/200 VUs, 782 complete and 0 interrupted iterations
shift_change_search ✓ [ 100% ] 200 VUs  30s