evidence/ops-2202-after-k6-payload-rerun.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2202.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 35s max duration (incl. graceful stop):
              * registration_surge: Up to 2000 looping VUs for 30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 5s)


running (00.9s), 0351/2000 VUs, 1258 complete and 0 interrupted iterations
registration_surge   [   3% ] 0351/2000 VUs  00.9s/30.0s

running (01.9s), 0751/2000 VUs, 2999 complete and 0 interrupted iterations
registration_surge   [   6% ] 0751/2000 VUs  01.9s/30.0s

running (02.9s), 1151/2000 VUs, 4855 complete and 0 interrupted iterations
registration_surge   [  10% ] 1151/2000 VUs  02.9s/30.0s

running (03.9s), 1551/2000 VUs, 6852 complete and 0 interrupted iterations
registration_surge   [  13% ] 1551/2000 VUs  03.9s/30.0s

running (04.9s), 1951/2000 VUs, 8919 complete and 0 interrupted iterations
registration_surge   [  16% ] 1951/2000 VUs  04.9s/30.0s

running (05.9s), 2000/2000 VUs, 10728 complete and 0 interrupted iterations
registration_surge   [  20% ] 2000/2000 VUs  05.9s/30.0s

running (06.9s), 2000/2000 VUs, 12697 complete and 0 interrupted iterations
registration_surge   [  23% ] 2000/2000 VUs  06.9s/30.0s

running (07.9s), 2000/2000 VUs, 14517 complete and 0 interrupted iterations
registration_surge   [  26% ] 2000/2000 VUs  07.9s/30.0s

running (08.9s), 2000/2000 VUs, 16311 complete and 0 interrupted iterations
registration_surge   [  30% ] 2000/2000 VUs  08.9s/30.0s

running (09.9s), 2000/2000 VUs, 17910 complete and 0 interrupted iterations
registration_surge   [  33% ] 2000/2000 VUs  09.9s/30.0s

running (10.9s), 2000/2000 VUs, 19491 complete and 0 interrupted iterations
registration_surge   [  36% ] 2000/2000 VUs  10.9s/30.0s

running (11.9s), 2000/2000 VUs, 21117 complete and 0 interrupted iterations
registration_surge   [  40% ] 2000/2000 VUs  11.9s/30.0s

running (12.9s), 2000/2000 VUs, 22832 complete and 0 interrupted iterations
registration_surge   [  43% ] 2000/2000 VUs  12.9s/30.0s

running (13.9s), 2000/2000 VUs, 24640 complete and 0 interrupted iterations
registration_surge   [  46% ] 2000/2000 VUs  13.9s/30.0s

running (14.9s), 2000/2000 VUs, 26852 complete and 0 interrupted iterations
registration_surge   [  50% ] 2000/2000 VUs  14.9s/30.0s

running (15.9s), 2000/2000 VUs, 28900 complete and 0 interrupted iterations
registration_surge   [  53% ] 2000/2000 VUs  15.9s/30.0s

running (16.9s), 2000/2000 VUs, 30774 complete and 0 interrupted iterations
registration_surge   [  56% ] 2000/2000 VUs  16.9s/30.0s

running (17.9s), 2000/2000 VUs, 32586 complete and 0 interrupted iterations
registration_surge   [  60% ] 2000/2000 VUs  17.9s/30.0s

running (18.9s), 2000/2000 VUs, 33933 complete and 0 interrupted iterations
registration_surge   [  63% ] 2000/2000 VUs  18.9s/30.0s

running (19.9s), 2000/2000 VUs, 35809 complete and 0 interrupted iterations
registration_surge   [  66% ] 2000/2000 VUs  19.9s/30.0s

running (20.9s), 2000/2000 VUs, 37769 complete and 0 interrupted iterations
registration_surge   [  70% ] 2000/2000 VUs  20.9s/30.0s

running (21.9s), 2000/2000 VUs, 39746 complete and 0 interrupted iterations
registration_surge   [  73% ] 2000/2000 VUs  21.9s/30.0s

running (22.9s), 2000/2000 VUs, 41916 complete and 0 interrupted iterations
registration_surge   [  76% ] 2000/2000 VUs  22.9s/30.0s

running (23.9s), 2000/2000 VUs, 43776 complete and 0 interrupted iterations
registration_surge   [  80% ] 2000/2000 VUs  23.9s/30.0s

running (24.9s), 2000/2000 VUs, 45737 complete and 0 interrupted iterations
registration_surge   [  83% ] 2000/2000 VUs  24.9s/30.0s

running (25.9s), 2000/2000 VUs, 47792 complete and 0 interrupted iterations
registration_surge   [  86% ] 2000/2000 VUs  25.9s/30.0s

running (26.9s), 2000/2000 VUs, 49822 complete and 0 interrupted iterations
registration_surge   [  90% ] 2000/2000 VUs  26.9s/30.0s

running (27.9s), 2000/2000 VUs, 51887 complete and 0 interrupted iterations
registration_surge   [  93% ] 2000/2000 VUs  27.9s/30.0s

running (28.9s), 2000/2000 VUs, 53906 complete and 0 interrupted iterations
registration_surge   [  96% ] 2000/2000 VUs  28.9s/30.0s

running (29.9s), 2000/2000 VUs, 56112 complete and 0 interrupted iterations
registration_surge   [ 100% ] 2000/2000 VUs  29.9s/30.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.57%


  █ TOTAL RESULTS 

    checks_total.......: 58371  1896.601476/s
    checks_succeeded...: 99.42% 58035 out of 58371
    checks_failed......: 0.57%  336 out of 58371

    ✗ status is 200
      ↳  99% — ✓ 58035 / ✗ 336

    HTTP
    http_req_duration..............: avg=955.4ms  min=6.9ms  med=797.96ms max=22.33s p(90)=1.02s p(95)=1.17s
      { expected_response:true }...: avg=874.08ms min=6.9ms  med=792.7ms  max=22.33s p(90)=1.02s p(95)=1.06s
    http_req_failed................: 0.57%  336 out of 58371
    http_reqs......................: 58371  1896.601476/s

    EXECUTION
    iteration_duration.............: avg=955.47ms min=6.94ms med=798.01ms max=22.33s p(90)=1.02s p(95)=1.17s
    iterations.....................: 58371  1896.601476/s
    vus............................: 2000   min=352          max=2000
    vus_max........................: 2000   min=2000         max=2000

    NETWORK
    data_received..................: 460 MB 15 MB/s
    data_sent......................: 5.2 MB 169 kB/s



running (30.8s), 0000/2000 VUs, 58371 complete and 0 interrupted iterations
registration_surge ✓ [ 100% ] 0000/2000 VUs  30s